{
  "trigger-happy.settings.folderJournalName.name": "Name of the Trigger Folder on Note sidebar to use",
  "trigger-happy.settings.folderJournalName.hint": "The name of the Trigger Folder on Note sidebar to use for listing triggers. The suggestion is to use one folder with this name. Default is 'Trigger Happy'",
  "trigger-happy.settings.journalName.name": "Name of the Trigger Journal to use",
  "trigger-happy.settings.journalName.hint": "The name of the journal entry to use for listing triggers. There can only be one. Refer to README file in module website for how to configure triggers. Default is 'Trigger Happy'",
  "trigger-happy.settings.enableTriggers.name": "Enable triggers when running as GM",
  "trigger-happy.settings.enableTriggers.hint": " ",
  "trigger-happy.settings.edgeCollision.name": "Capture at edge of drawing/token",
  "trigger-happy.settings.edgeCollision.hint": " ",
  "trigger-happy.settings.enableTriggerButton.name": "Add enable/disable trigger happy button",
  "trigger-happy.settings.enableTriggerButton.hint": " ",
  "trigger-happy.labels.button.layer.enableTriggerHappy": "Enable Trigger Happy triggers",
  "trigger-happy.settings.enableTaggerIntegration.name": "Enable tagger integration feature",
  "trigger-happy.settings.enableTaggerIntegration.hint": "This feature need the tagger module installed and active, we filter the triggers only for the placeables object with one of the tag setted, the value is read like list of strings of tags separate from ',' e.g. 'tag1,tag2'. NOTE: you can avoid to enable this feature and just use @TAG on the journal, this is more for set some global tag to all the triggers",
  "trigger-happy.settings.enableJournalForSceneIntegration.name": "Enable 'journal for every scene' integration feature",
  "trigger-happy.settings.enableJournalForSceneIntegration.hint": "Sometime trigger are mixed up between scene and broke something, if this feature is enabled the module will try to find and parse only the journal starting with the same name (or id) of the current scene the clients are viewing. If no journal is found is rollback to standard mechanism and parse all the journals under the trigger folder. NOTE: if more scene have the same name the trigger are activated for all these scenes, if you really want you can avoid this specific issue by using the id of the scene",
  "trigger-happy.settings.onlyUseJournalForSceneIntegration.name": "Enable 'only use journal for every scene' integration feature",
  "trigger-happy.settings.onlyUseJournalForSceneIntegration.hint": "This setting make sense only with the setting 'journal for every scene' to true, it will disable the rollback to the standard parsing of the journals and make the parsing faster. ATTENTION: All the trigger on journals/notes that are not renamed based on a scene name/id will be ignored",
  "trigger-happy.settings.enableAvoidDeselectOnTriggerEvent.name": "Enable avoid to deselect elements on the trigger event",
  "trigger-happy.settings.enableAvoidDeselectOnTriggerEvent.hint": "To remedy an incompatibility with other modules at the time of the 'mouse down' or other events together with the core setting 'Left-Click to Release Object' active, it is necessary that if a placeable object is selected on that event it remains at the event of 'mouse up' still selected. Unfortunately I have not found any other solution than to temporarily set the 'Left-Click to Release Object' setting to false (only if active) and then reset it to the original state at the 'mouse up' event. YOU NEED A REFRESH OF THE PAGE FOR APPLY THIS",
  "trigger-happy.settings.ifNoTokenIsFoundTryToUseActor.name": "If no token is found with that name try to found a token on the canvas linked to a actor with that id or name",
  "trigger-happy.settings.ifNoTokenIsFoundTryToUseActor.hint": "If no token is found with that name try to found a token on the canvas linked to a actor with that id or name, can be useful with some module like token mold where N tokens are linked to the same actor WORK ONLY '@Token' TRIGGERS.",
  "trigger-happy.settings.disableWarningMessages.name": "Disable warning messages",
  "trigger-happy.settings.disableWarningMessages.hint": "If checked this setting will disable all the warnings generate from the loading of the triggers. Is useful to let this disabled when you are developing your trigger.",
  "trigger-happy.settings.enableMultipleTriggerSearch.name": "Enable multiple trigger search",
  "trigger-happy.settings.enableMultipleTriggerSearch.hint": "If enabled this setting will registered not just the first, but all the trigger with the same name and id if they pass the filter, is enabled by default for retrocompatibility",
  "trigger-happy.settings.enableEnrichHtml.name": "Enable rendering of trigger with html on journal",
  "trigger-happy.settings.enableEnrichHtml.hint": "If enable will parse the syntax structure of the trigger and show a empty href html on the rendered sheet of the journal",
  "trigger-happy.settings.disableAllHidden.name": "Disable all trigger for hidden element",
  "trigger-happy.settings.disableAllHidden.hint": "If enabled this setting will disable by default all trigger for all placeable objects with the 'Toogle Visibility state' set to true like 'Token','Drawing',ecc. NOTE if on teh event link you have set explicity a `onlyIfHidden`, `onlyIfUnHidden` they have priority to this."
}
